# Data Preprocessing

**Importing the libraries**

In [14]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

**Reading the data**

In [3]:
df = pd.read_csv("baby_names.csv")

In [5]:
df.head()

   Unnamed: 0 State Sex  Year    Name  Count
0           0    GA   F  1910    Mary    841
1           1    GA   F  1910   Annie    553
2           2    GA   F  1910  Mattie    320
3           3    GA   F  1910    Ruby    279
4           4    GA   F  1910  Willie    275

In [9]:
df.shape

(890627, 6)

In [10]:
df.tail()

        Unnamed: 0 State Sex  Year      Name  Count
890622      890622    VA   M  2019     Yerik      5
890623      890623    VA   M  2019     Yosef      5
890624      890624    VA   M  2019    Zakari      5
890625      890625    VA   M  2019  Zakariya      5
890626      890626    VA   M  2019      Zuri      5

**Taking care of missing values**

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 890627 entries, 0 to 890626
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   Unnamed: 0  890627 non-null  int64
 1   State       890627 non-null  object
 2   Sex         890627 non-null  object
 3   Year        890627 non-null  int64
 4   Name        890627 non-null  object
 5   Count       890627 non-null  int64
dtypes: int64(3), object(3)
memory usage: 40.8+ MB

In [12]:
df.isnull()

        Unnamed: 0  State    Sex   Year   Name  Count
0            False  False  False  False  False  False
1            False  False  False  False  False  False
2            False  False  False  False  False  False
3            False  False  False  False  False  False
4            False  False  False  False  False  False
...            ...    ...    ...    ...    ...    ...
890622       False  False  False  False  False  False
890623       False  False  False  False  False  False
890624       False  False  False  False  False  False
890625       False  False  False  False  False  False
890626       False  False  False  False  False  False

[890627 rows x 6 columns]

In [13]:
print(df.isnull().sum())

Unnamed: 0    0
State         0
Sex           0
Year          0
Name          0
Count         0
dtype: int64

 **Encoding